rule mandiant_mati_ioc_target_domain_observed_network_connection {

  meta:
    // Mandatory meta fields
    author = "thatsiemguy@"
    owner = "secops-t3@" 
    description = "Matches UDM NETWORK Events against MATI Domain IOCs.  This Detection does not look for DNS activity."
    response = "Evaluate the IOC match in MATI to determine the Feed source, matching MISP Tags, Severity, and Attributied Associations"
    severity = "MEDIUM"
    priority = "MEDIUM"
    // Optional, but desired meta fields
    mitre_mitigation = "M1019"
    mati_types = "domain"

  events:
    (
        $e.metadata.event_type = "NETWORK_CONNECTION" or
        $e.metadata.event_type = "NETWORK_HTTP" or
        $e.metadata.event_type = "NETWORK_FTP" or
        $e.metadata.event_type = "NETWORK_SMTP" or
        $e.metadata.event_type = "NETWORK_FLOW" or        
        $e.metadata.event_type = "NETWORK_UNCATEGORIZED"
    )
    $e.target.hostname != ""
    $e.target.hostname = $domain
    $asset = strings.coalesce($e.principal.hostname, $e.principal.ip)

    $g.graph.metadata.vendor_name = "MANDIANT_IOC"
    $g.graph.metadata.entity_type = "DOMAIN_NAME"
    $g.graph.entity.hostname = $domain

  match:
    $asset, $domain over 1m

  outcome:
    $risk_score = max(
        50 +
        if($e.security_result.action = "ALLOW", 10) -
        if($e.security_result.action = "BLOCK", 10) +
        // 
        if($g.graph.metadata.threat.category_details = "digitalside_it_domains",  0) +
        if($g.graph.metadata.threat.category_details = "cinsscore_ci_badguys", 0) +
        if($g.graph.metadata.threat.category_details = "Mandiant", 0) +
        if($g.graph.metadata.threat.category_details = "urlhaus", 0) +
        if($g.graph.metadata.threat.category_details = "blocklist_de", 0) +
        if($g.graph.metadata.threat.category_details = "blocklist_net_ua", 0) +
        if($g.graph.metadata.threat.category_details = "phishing_database", 0) +
        if($g.graph.metadata.threat.category_details = "rutgers_drop", 0) +
        if($g.graph.metadata.threat.category_details = "digitalside_it_hashes", 0) +
        if($g.graph.metadata.threat.category_details = "greensnow", 0) +
        if($g.graph.metadata.threat.category_details = "the_haleys_ssh_dict_attack", 0) +
        if($g.graph.metadata.threat.category_details = "digitalside_it_ips", 0) +
        if($g.graph.metadata.threat.category_details = "digitalside_it_urls", 0) +
        if($g.graph.metadata.threat.category_details = "abuse_ch_sslipbl_aggressive", 0) +
        if($g.graph.metadata.threat.category_details = "dtm.blackbeard", 0) +
        if($g.graph.metadata.threat.category_details = "voipbl", 0) +
        if($g.graph.metadata.threat.category_details = "phishtank", 0) +
        if($g.graph.metadata.threat.category_details = "turris_greylist", 0) +
        if($g.graph.metadata.threat.category_details = "dtm.vanellope", 0) +
        if($g.graph.metadata.threat.category_details = "abuse_ch_sslipbl", 0) +
        if($g.graph.metadata.threat.category_details = "ookangzheng", 0) +
        if($g.graph.metadata.threat.category_details = "phishstats", 0) +
        if($g.graph.metadata.threat.category_details = "phishtank_valid_online", 0) +
        if($g.graph.metadata.threat.category_details = "emergingthreats_compromised_ips", 0) +
        if($g.graph.metadata.threat.category_details = "rulez_blist", 0) +
        if($g.graph.metadata.threat.category_details = "badips", 0) +
        if($g.graph.metadata.threat.category_details = "alienvault_reputation", 0) +
        if($g.graph.metadata.threat.category_details = "dshield_block", 0) +
        if($g.graph.metadata.threat.category_details = "nixspam", 0) +
        if($g.graph.metadata.threat.category_details = "darklist", 0) +
        if($g.graph.metadata.threat.category_details = "futex.re", 0) +
        if($g.graph.metadata.threat.category_details = "stdominics_ips_high_confidence", 0) +
        if($g.graph.metadata.threat.category_details = "spamhaus_edrop", 0) +
        if($g.graph.metadata.threat.category_details = "sblam_blacklist", 0) +
        if($g.graph.metadata.threat.category_details = "stopforumspam", 0) +
        if($g.graph.metadata.threat.category_details = "sebsauvage", 0) +
        if($g.graph.metadata.threat.category_details = "imperium_ra8", 0) +
        if($g.graph.metadata.threat.category_details = "aa419", 0) +
        if($g.graph.metadata.threat.category_details = "torproject_bulk", 0) +
        if($g.graph.metadata.threat.category_details = "torlist", 0) +
        if($g.graph.metadata.threat.category_details = "binarydefense_banlist", 0) +
        if($g.graph.metadata.threat.category_details = "digitalside_it_domains", 0) +
        if($g.graph.metadata.threat.category_details = "torstatus_rueckgr", 0) +
        if($g.graph.metadata.threat.category_details = "botscout", 0) +
        if($g.graph.metadata.threat.category_details = "cybercrimetracker_fuckers", 0) +
        if($g.graph.metadata.threat.category_details = "viriback", 0) +
        if($g.graph.metadata.threat.category_details = "azorult-tracker", 0) +
        if($g.graph.metadata.threat.category_details = "energized_pro", 0) +
        if($g.graph.metadata.threat.category_details = "myip_blacklist", 0) +
        if($g.graph.metadata.threat.category_details = "emergingthreats_tor", 0) +
        if($g.graph.metadata.threat.category_details = "feodo", 0) +
        if($g.graph.metadata.threat.category_details = "BBcan177_ips", 0) +
        if($g.graph.metadata.threat.category_details = "gpf_comics", 0) +
        if($g.graph.metadata.threat.category_details = "feodo_ids", 0) +
        if($g.graph.metadata.threat.category_details = "talos_blacklist_ips", 0) +
        if($g.graph.metadata.threat.category_details = "adblock_nocoin", 0) +
        if($g.graph.metadata.threat.category_details = "unsubscore", 0) +
        if($g.graph.metadata.threat.category_details = "iscsans-low", 0) +
        //
        if($g.graph.additional.fields["akamai"] = "True", 0) +
        if($g.graph.additional.fields["alexa"] = "True", 0) +
        if($g.graph.additional.fields["alexa_1M"] = "True", 0) +
        if($g.graph.additional.fields["amazon-aws"] = "True", 0) +
        if($g.graph.additional.fields["apple"] = "True", 0) +
        if($g.graph.additional.fields["automated-malware-analysis"] = "True", 0) +
        if($g.graph.additional.fields["bank-website"] = "True", 0) +
        if($g.graph.additional.fields["cisco_1M"] = "True", 0) +
        if($g.graph.additional.fields["cisco_top1000"] = "True", 0) +
        if($g.graph.additional.fields["cisco_top10k"] = "True", 0) +
        if($g.graph.additional.fields["cisco_top20k"] = "True", 0) +
        if($g.graph.additional.fields["cisco_top5k"] = "True", 0) +
        if($g.graph.additional.fields["cloudflare"] = "True", 0) +
        if($g.graph.additional.fields["common-contact-emails"] = "True", 0) +
        if($g.graph.additional.fields["common-ioc-false-positive"] = "True", 0) +
        if($g.graph.additional.fields["covid"] = "True", 0) +
        if($g.graph.additional.fields["covid-19-cyber-threat-coalition-whitelist"] = "True", 0) +
        if($g.graph.additional.fields["covid-19-krassi-whitelist"] = "True", 0) +
        if($g.graph.additional.fields["crl-hostname"] = "True", 0) +
        if($g.graph.additional.fields["crl-ip"] = "True", 0) +
        if($g.graph.additional.fields["dax30"] = "True", 0) +
        if($g.graph.additional.fields["disposable-email"] = "True", 0) +
        if($g.graph.additional.fields["dynamic-dns"] = "True", 0) +
        if($g.graph.additional.fields["eicar.com"] = "True", 0) +
        if($g.graph.additional.fields["empty-hashes"] = "True", 0) +
        if($g.graph.additional.fields["fastly"] = "True", 0) +
        if($g.graph.additional.fields["google"] = "True", 0) +
        if($g.graph.additional.fields["google-gcp"] = "True", 0) +
        if($g.graph.additional.fields["google-gmail-sending-ips"] = "True", 0) +
        if($g.graph.additional.fields["googlebot"] = "True", 0) +
        if($g.graph.additional.fields["ipv6-linklocal"] = "True", 0) +
        if($g.graph.additional.fields["majestic_million"] = "True", 0) +
        if($g.graph.additional.fields["majestic_million_1M"] = "True", 0) +
        if($g.graph.additional.fields["microsoft"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-attack-simulator"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-azure"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-azure-china"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-azure-germany"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-azure-us-gov"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-office365"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-office365-cn"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-office365-ip"] = "True", 0) +
        if($g.graph.additional.fields["microsoft-win10-connection-endpoints"] = "True", 0) +
        if($g.graph.additional.fields["moz-top500"] = "True", 0) +
        if($g.graph.additional.fields["mozilla-CA"] = "True", 0) +
        if($g.graph.additional.fields["mozilla-IntermediateCA"] = "True", 0) +
        if($g.graph.additional.fields["multicast"] = "True", 0) +
        if($g.graph.additional.fields["nioc-filehash"] = "True", 0) +
        if($g.graph.additional.fields["ovh-cluster"] = "True", 0) +
        if($g.graph.additional.fields["phone_numbers"] = "True", 0) +
        if($g.graph.additional.fields["public-dns-hostname"] = "True", 0) +
        if($g.graph.additional.fields["public-dns-v4"] = "True", 0) +
        if($g.graph.additional.fields["public-dns-v6"] = "True", 0) +
        if($g.graph.additional.fields["rfc1918"] = "True", 0) +
        if($g.graph.additional.fields["rfc3849"] = "True", 0) +
        if($g.graph.additional.fields["rfc5735"] = "True", 0) +
        if($g.graph.additional.fields["rfc6598"] = "True", 0) +
        if($g.graph.additional.fields["rfc6761"] = "True", 0) +
        if($g.graph.additional.fields["second-level-tlds"] = "True", 0) +
        if($g.graph.additional.fields["security-provider-blogpost"] = "True", 0) +
        if($g.graph.additional.fields["sinkholes"] = "True", 0) +
        if($g.graph.additional.fields["smtp-receiving-ips"] = "True", 0) +
        if($g.graph.additional.fields["smtp-sending-ips"] = "True", 0) +
        if($g.graph.additional.fields["stackpath"] = "True", 0) +
        if($g.graph.additional.fields["ti-falsepositives"] = "True", 0) +
        if($g.graph.additional.fields["tlds"] = "True", 0) +
        if($g.graph.additional.fields["tranco"] = "True", 0) +
        if($g.graph.additional.fields["tranco10k"] = "True", 0) +
        if($g.graph.additional.fields["university_domains"] = "True", 0) +
        if($g.graph.additional.fields["url-shortener"] = "True", 0) +
        if($g.graph.additional.fields["vpn-ipv4"] = "True", 0) +
        if($g.graph.additional.fields["vpn-ipv6"] = "True", 0) +
        if($g.graph.additional.fields["whats-my-ip"] = "True", 0) +
        if($g.graph.additional.fields["wikimedia"] = "True", 0)
    )
    $oc_confidence_score = array_distinct($g.graph.metadata.threat.confidence_details)
    $oc_threat_name = array_distinct($g.graph.metadata.threat.threat_name)
    $oc_threat_id = array_distinct($g.graph.metadata.threat.threat_id)
    $oc_link_to_mati = array_distinct($g.graph.metadata.threat.url_back_to_product)

  condition:
    $e and $g and $risk_score >= 40
}
